Revit 2026 API

# ViewScheduleGroupHeaders Method

---

Groups schedule header cells.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void GroupHeaders(
	int top,
	int left,
	int bottom,
	int right,
	string caption
)
```
```vb
Public Sub GroupHeaders (
	top As Integer,
	left As Integer,
	bottom As Integer,
	right As Integer,
	caption As String
)
```
```cpp
public:
void GroupHeaders(
	int top,
	int left,
	int bottom,
	int right,
	String^ caption
)
```
```fsharp
member GroupHeaders :
        top : int *
        left : int *
        bottom : int *
        right : int *
        caption : string -> unit
```

#### Parameters

top Int32
     The index of the top row of the selected headers.
left Int32
     The index of the left column of the selected headers.
bottom Int32
     The index of the bottom row of the selected headers.
right Int32
     The index of the right column of the selected headers.
caption String
     The header caption.

| Exception | Condition |
| --- | --- |
| ArgumentException | Headers could not be grouped. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ViewSchedule Class

Autodesk.Revit.DB Namespace